add: Gray-Scott Reaction-Diffusion (RD) system
